<?php

return [

    'title' => 'إعادة تعيين كلمة المرور',

    'heading' => 'هل نسيت كلمة المرور؟',

    'buttons' => [

        'login' => [
            'label' => 'العودة لصفحة تسجيل الدخول',
        ],

        'request' => [
            'label' => 'إرسال البريد الإلكتروني',
        ],

    ],

    'fields' => [

        'email' => [
            'label' => 'البريد الإلكتروني',
        ],

    ],

    'messages' => [
        'throttled' => 'عدد الطلبات كثيرة. يرجى المحاولة مرة أخرى في :seconds ثانية.',
    ],

];
