<?php

return [

    'title' => 'المصادقة الثنائية العاملة',

    'description' => 'إضافة أمان إضافي لحسابك باستخدام المصادقة الثنائية العاملة.',

    'note' => 'عند تمكين المصادقة الثنائية العاملة، سيتم طلب توكن آمن وعشوائي أثناء المصادقة. يمكنك الحصول على هذا التوكن من تطبيق Google Authenticator على هاتفك.',

    'setup_key' => 'مفتاح الإعداد',

    'enabled' => [
        'title' => 'لقد قمت بتمكين المصادقة الثنائية العاملة.',
        'description' => 'تم تمكين المصادقة الثنائية العاملة. قم بمسح الرمز الشريطي QR التالي باستخدام تطبيق المصادقة على هاتفك.',
        'store_codes' => 'قم بحفظ رموز الاسترداد هذه في مدير كلمات المرور الآمن. يمكن استخدامها لاسترداد الوصول إلى حسابك إذا فقدت جهاز المصادقة الخاص بك.',
    ],

    'disabled' => [
        'title' => 'لم تمكّن المصادقة الثنائية العاملة.',
    ],

    'finish_enabling' => [
        'title' => 'إكمال تمكين المصادقة الثنائية العاملة.',
        'description' => 'لإكمال تمكين المصادقة الثنائية العاملة، قم بمسح الرمز الشريطي QR التالي باستخدام تطبيق المصادقة على هاتفك أو أدخل مفتاح الإعداد وقدم رمز OTP المولد.',
    ],

    'buttons' => [
        'enable' => 'تمكين',
        'regenerate_codes' => 'تجديد الرموز',
        'disable' => 'تعطيل',
        'confirm_finish' => 'تأكيد والإنهاء',
        'cancel_setup' => 'إلغاء الإعداد',
        'show_codes' => 'عرض رموز الاسترداد',
        'hide_codes' => 'إخفاء رموز الاسترداد',
    ],

    'fields' => [
        'code' => 'الكود',
        'recovery_code' => 'رمز الاسترداد',
    ],

    'messages' => [
        'verified' => 'تم التحقق من الرمز. تم تمكين المصادقة الثنائية.',
        'disabled' => 'تم تعطيل المصادقة الثنائية.',
        'recovery_codes_regenerated' => 'تمت إعادة إنشاء رموز الاسترداد.',
        'invalid_code' => 'الرمز الذي قمت بإدخاله غير صحيح.',
        'invalid_confirmation_code' => 'كود المصادقة الثنائية الذي تم تقديمه غير صالح.',
    ],



];
